# === ДЗ 12.3 : Перевірка на парність ===

def is_even(number):

    last_digit = str(number)[-1]

    return last_digit in "02468"

assert is_even(2494563894038**2) == True, 'Test1'
assert is_even(1056897**2) == False, 'Test2'
assert is_even(24945638940387**3) == False, 'Test3'

print('Ok')


# Приклади:
#
# def is_even(number):
#     pass
#
# assert is_even(2494563894038**2) == True, 'Test1'
# assert is_even(1056897**2) == False, 'Test2'
# assert is_even(24945638940387**3) == False, 'Test3'

# функція працює правильно, після запуску файлу внизу консолі ми бачимо слово- "ОК".

# за умовою заборонено використовувати оператори ділення та взяття залишку, зробили перевірку через
# аналіз останньої цифри числа.
# перетворили число на рядок str(number), взяли його останній символ за допомогою зрізу [-1]
# та перевірили його наявність серед парних чисел "02468" через оператор in.
# це максимально швидкий підхід і не залежить від розміру числа.