# === ДЗ 4.1 : Переместити всі нулі до кінця списку ===

nums = [9, 0, 7, 31, 0, 45, 0, 45, 0, 45, 0, 0, 96, 0]

result = []

zeros_count = 0

for num in nums:
    if num == 0:
        zeros_count += 1
    else:
        result.append(num)
result.extend([0] * zeros_count)

print(result)

# Приклади:
# [0, 1, 0, 12, 3] -> [1, 12, 3, 0, 0]
# [0] -> [0]
# [1, 0, 13, 0, 0, 0, 5] -> [1, 13, 5, 0, 0, 0, 0]
# [9, 0, 7, 31, 0, 45, 0, 45, 0, 45, 0, 0, 96, 0] -> [9, 7, 31, 45, 45, 45, 96, 0, 0, 0, 0, 0, 0, 0]
# усі приклади перевірила, вони працюють